[
  {
    "id": "gnss-drone",
    "title": "Autonomous Drone for GNSS-Denied Environments",
    "short_description": "A drone designed to operate without GNSS signals for navigation.",
    "description": "This autonomous drone is developed for GNSS-denied environments such as indoors, tunnels, or under dense canopy. It leverages onboard sensors, visual odometry, SLAM techniques, and AI-driven navigation to maintain precise positioning and stability where GPS is unavailable. Designed for applications in defense, search and rescue, and exploration.",
    "link": "gnss-drone",
    "image": "gnss-drone.webp"
  },

  {
    "id": "avibot",
    "title": "Avibot",
    "short_description": "Automated Egg Collecting Farm Bot that optimizes poultry farm efficiency.",
    "description": "Avibot is designed to automate egg collection in poultry farms, ensuring faster collection, reducing human labor, and improving overall farm productivity. Equipped with sensors and AI-based path planning, it navigates poultry houses efficiently while minimizing stress on the birds.",
    "link": "avibot",
    "image": "avibot.webp"
  },
  {
    "id": "riggu",
    "title": "Riggu",
    "short_description": "Semi-humanoid healthcare assistant robot.",
    "description": "A semi-humanoid robot for healthcare assistance, equipped with SLAM-based navigation, a touchscreen database, facial recognition, and autonomous item retrieval. Riggu aims to support doctors by enhancing patient care and decision-making.",
    "link": "riggu",
    "image": "riggu.webp"
  },

   {
    "id": "hospital-bed",
    "title": "Adjustable Hospital Bed",
    "short_description": "Chain-driven hospital bed with tilt and ROS2 control.",
    "description": "A novel chain-driven hospital bed designed to prevent bedsores with tilting features and a compact design. It uses ROS2 for communication and can be controlled via a remote, mobile app, or IoT devices using OpenCV-based blink detection.",
    "link": "hospital-bed",
    "image": "hospbed.webp"
  },

  {
    "id": "origami-bot",
    "title": "Origami Bot",
    "short_description": "Transformable multipurpose robot for defense.",
    "description": "A multipurpose utility inspired by origami, capable of transforming into a boat, tent, or shield. Designed for soldiers, it uses actuation mechanisms like tendons or hinged motors to create compact and expandable structures for extreme weather conditions and sudden attacks.",
    "link": "origami-bot",
    "image": "image.webp"
  },
  {
    "id": "auv",
    "title": "AUV Varuna",
    "short_description": "An advanced underwater vehicle with object detection and torpedo launch capability.",
    "description": "The AUV Varuna, an underwater robot, features five degrees of freedom and capabilities like object detection, precise path following, and torpedo launching. Equipped with sensors to monitor temperature and pressure, along with webcams for image data acquisition, it is designed to advance underwater robotics.",
    "link": "auv",
    "image": "image.webp"
  },
  {
    "id": "swab-testing-machine",
    "title": "Swab Testing Machine",
    "short_description": "Automated nasal and oropharyngeal swab testing robot.",
    "description": "An automated robot for nasal and oropharyngeal swab tests, featuring a 5-DOF manipulator and a Kinect camera system for precise nose detection. Incorporates YOLOv5 for accuracy, force sensors for safe operation, and advanced safety measures to minimize risks.",
    "link": "swab-testing-machine",
    "image": "image.webp"
  },
  {
    "id": "multi-rotor-uav",
    "title": "Fully Actuated Multi-Rotor UAV",
    "short_description": "Smart farming UAV with fully actuated rotors.",
    "description": "A UAV designed for smart farming, overcoming limitations of conventional UAVs with fully actuated rotors for precise interaction with crops. It focuses on soil map generation through on-the-go soil data collection and addresses challenges like low flight time and payload capacity.",
    "link": "multi-rotor-uav",
    "image": "image.webp"
  },
  {
    "id": "agribot",
    "title": "Agribot",
    "short_description": "Autonomous agricultural vehicle for multiple farming tasks.",
    "description": "An advanced autonomous agricultural vehicle for tasks like tilling, harvesting, and pesticide spraying. Features include weed detection algorithms, 3D mapping, obstacle avoidance, IMU and GPS integration, and image processing for plant disease and weed identification.",
    "link": "agribot",
    "image": "image.webp"
  },
  {
    "id": "quadruped",
    "title": "Quadruped",
    "short_description": "Load-carrying quadruped robot inspired by elephants.",
    "description": "A quadruped robot inspired by elephants, prioritizing stability over speed for traversing difficult terrains. Designed to carry heavy loads efficiently, it deviates from the traditional speed-focused quadruped design.",
    "link": "quadruped",
    "image": "image.webp"
  },
 
  {
    "id": "soil-uav",
    "title": "UAV for Soil Mapping",
    "short_description": "Drone with multispectral cameras for soil & crop analysis.",
    "description": "An unmanned aerial vehicle equipped with multispectral and hyperspectral cameras for high-resolution soil mapping. It provides valuable data on soil properties, crop health, and terrain, contributing to efficient agricultural and environmental applications.",
    "link": "soil-uav",
    "image": "image.webp"
  },
  {
    "id": "coconut-sorting-robot",
    "title": "Coconut Sorting Robot",
    "short_description": "Automated system to sort coconuts by physical and visual traits.",
    "description": "The main goal of the project is to develop and design an automated system that can effectively sort coconuts according to a variety of physical and visual characteristics. With its labour-intensive, time-consuming, and inconsistent nature, the system aims to overcome the drawbacks of conventional manual sorting techniques.",
    "link": "coconut-sorting-robot",
    "image": "image.webp"
  }
]
