[
  {
    "title": "ISRO Robotics Challenge (IRoCU 2025)",
    "description": "Made it to the qualification round and secured a place among the top 24 teams across India."
  },
    {
    "title": "LAM Research Challenge 2024",
    "description": "Participated with a cross-disciplinary project demonstrating firmware, hardware, systems engineering, and business acumen."
  },
  {
    "title": "Janatics Automation Challenge 2024",
    "description": "Secured a top position in the challenge."
  },
  {
    "title": "Eyantra'24",
    "description": "Participated in Eyantra'24 with a Self Balancing Bot project."
  },
  {
    "title": "Origo Workshop",
    "description": "Conducted a two-day hands-on workshop introducing robotics for B23 students of NIT Calicut."
  },
  {
    "title": "Robocon'23",
    "description": "Took part in Robocon'23, an international robotics competition, and secured among the top position defeating all other NITs or IITs."
  },
  {
    "title": "IInvenTiv mega R&D fair",
    "description": "Two projects were selected from NIT, out of which one was from RIG. This project was presented in front of the Hon'ble education minister of India."
  },
  {
    "title": "Eyanthra'23",
    "description": "Two teams from RIG participated in the Eyanthra'23 robotics competition organized by IIT Bombay. One team successfully completed all the assigned tasks, while the other team secured the top position in all India levels."
  },
  {
    "title": "ISRO Rover Challenge",
    "description": "Qualified for the second round of the ISRO Rover Challenge competition, with submissions for the second round due on May 15th."
  },
  {
    "title": "UL space club lecture",
    "description": "Conducted a one-day lecture on robotics followed by a mini expo for school students in UL Cyber Park."
  },
  {
    "title": "Patent granted",
    "description": "A patent was awarded for one of RIG's significant projects, the Hospital Bed, specifically designed to assist physically challenged patients."
  },
  {
    "title": "Robocon'24",
    "description": "Advanced to the second round of Robocon'24, and are currently engaged in the second stage of submissions."
  },
  {
    "title": "KTX Expo",
    "description": "Showcased AVIBOT, one of RIG's flagship projects, at the KTX Global, aiming to attract industry partnerships to make the product market-ready."
  },
  {
    "title": "Disha Expo",
    "description": "Represented NIT Calicut at Disha Expo'23, showcasing a few RIG projects to higher secondary school students."
  },
  {
    "title": "Lab Visits",
    "description": "Held several lab visits for school students, showcasing robotic technologies and ongoing projects in RIG."
  }
]
