[
  {
    "title": "ISRO Robotics Challenge (IRoCU 2025)",
    "description": "Made it to the qualification round and secured a place among the top 24 teams across India.",
    "photo": "assets/images/achievements/competitions/ISRO.webp"
  },
  {
    "title": "LAM Research Challenge 2024",
    "description": "Participated with a cross-disciplinary project demonstrating firmware, hardware, systems engineering, and business acumen.",
    "photo": "assets/images/achievements/competitions/LAM.webp"
  },
  {
    "title": "Mathworks Mini Drone Challenge 2024",
    "description": "Participated in the MathWorks Mini Drone Challenge 2024, showcasing drone design, control, and simulation skills using MATLAB and Simulink for real-world problem solving.",
    "photo": "assets/images/achievements/competitions/MINIDRONE.webp"
  },
  {
    "title": "Robocon'23",
    "description": "Took part in Robocon'23, an international robotics competition, and secured among the top position defeating all other NITs or IITs.",
    "photo": "assets/images/achievements/competitions/ROBOCON.webp"
  },
  {
    "title": "FESTO International Productivity Contest",
    "description": "(Mr Ajith A.M. , 2015 B.Tech Mech Engg) won Third prize for FESTO’s International Productivity Contest for the development of the Wall Climbing Robot (Germany 2015). This was with a fully sponsored trip to Hannover Messe, Germany. 2015 ",
    "photo": "assets/images/achievements/competitions/festo.png"
  },
  {
    "title": "Janatics Automation Skill Challenge 2024",
    "description": "(Mr. Arnav Mishra, 2026 B.tech Mech Engg) Secured a top position in the Janatics Automation Skill Challenge 2024 by demonstrating excellence in automation system design, control strategies, and practical implementation.",
    "photo": "assets/images/achievements/competitions/janatics.png"
  },
  {
    "title": "Swasraya Bharath Innovation Challenge",
    "description": "Won 1st prize in Swasraya Bharath Innovation Challenge",
    "photo": "assets/images/achievements/competitions/swasraya.png"
  },
  {
    "title": "Robocon'24",
    "description": "Advanced to the second round of Robocon'24",
    "photo": "assets/images/achievements/competitions/robocon24.png"
  },
  {
    "title": "Eyantra'22",
    "description": "All India Rank 7 in Eyantra'22 robotics competition organized by IIT Bombay"
  },
  {
    "title": "Eyantra'23",
    "description": "Two teams from RIG participated in the Eyanthra'23 robotics competition organized by IIT Bombay. One team successfully completed all the assigned tasks, while the other team secured the top position in all India levels."
  },
  {
    "title": "Eyantra'24",
    "description": "Participated in Eyantra'24 with a Self Balancing Bot project."
  },
  {
    "title": "Eyantra'25",
    "description": "Participating in Eyantra'25 with an FPGA-based Maze Solving Robot project."
  },
  {
    "title": "ISRO Rover Challenge",
    "description": "Qualified for the second round of the ISRO Rover Challenge competition, with submissions for the second round due on May 15th."
  }
]
